# Linux taps
tap "hashicorp/tap"
tap "meridian-online/tap"

# Linux CLI tools
brew "aria2"
brew "awscli"
brew "bash-language-server"
brew "bat"
brew "carapace"
brew "chafa"
brew "chezmoi"
brew "cloudflare-cli4"
brew "docker"
brew "duckdb"
brew "fd"
brew "fzf"
brew "gdu"
brew "gh"
brew "gitui"
brew "glow"
brew "go"
brew "helix"
brew "hf"
brew "jq"
brew "lazygit"
brew "marksman"
brew "navi"
brew "prettier"
brew "pyright"
brew "resvg"
brew "ripgrep"
brew "rust"
brew "sql-formatter"
brew "starship"
brew "taplo"
brew "tmux"
brew "tree"
brew "ty"
brew "typescript-language-server"
brew "uv"
brew "visidata"
brew "wget"
brew "yaml-language-server"
brew "yazi"
brew "youplot"
brew "zoxide"
brew "hashicorp/tap/terraform"
brew "meridian-online/tap/finetype"

# Linux casks
cask "gcloud-cli"
