# macOS taps
tap "antoniorodr/memo"
tap "hashicorp/tap"
tap "hudochenkov/sshpass"
tap "hypewell-ai/tap"
tap "meridian-online/tap"
tap "mutagen-io/mutagen"
tap "oven-sh/bun"
tap "steipete/tap"
tap "yakitrak/yakitrak"

# macOS CLI tools
brew "age"
brew "awscli"
brew "bash-language-server"
brew "bat"
brew "carapace"
brew "chawan"
brew "chezmoi"
brew "cloudflare-cli4"
brew "curl"
brew "docker"
brew "duckdb"
brew "exif"
brew "fd"
brew "ffmpeg"
brew "firebase-cli"
brew "fish"
brew "fnm"
brew "fx"
brew "fzf"
brew "gdu"
brew "gemini-cli"
brew "gh"
brew "git-filter-repo"
brew "glow"
brew "go"
brew "gonzo"
brew "goreleaser"
brew "hf"
brew "htop"
brew "imagemagick"
brew "jless"
brew "jq"
brew "katana"
brew "lazygit"
brew "marksman"
brew "mas"
brew "micromamba"
brew "navi"
brew "neovim"
brew "nushell"
brew "nvtop"
brew "opencode"
brew "pngpaste"
brew "poppler"
brew "prettier"
brew "pyright"
brew "rclone"
brew "resvg"
brew "ripgrep"
brew "rust"
brew "rust-analyzer"
brew "sd"
brew "specify"
brew "sql-formatter"
brew "sqlfluff"
brew "sqruff"
brew "starship"
brew "stripe-cli"
brew "superfile"
brew "taplo"
brew "tealdeer"
brew "tmux"
brew "todoist-cli"
brew "tree"
brew "typescript-language-server"
brew "ty"
brew "uv"
brew "vim"
brew "visidata"
brew "watch"
brew "wget"
brew "yaml-language-server"
brew "xan"
brew "xq"
brew "yazi", args: ["HEAD"]
brew "youplot"
brew "yq"
brew "yt-dlp"
brew "zoxide"
brew "zsh-autocomplete"
brew "antoniorodr/memo/memo"
brew "hashicorp/tap/terraform"
brew "hudochenkov/sshpass/sshpass"
brew "hypewell-ai/tap/hy"
brew "meridian-online/tap/finetype"
brew "mutagen-io/mutagen/mutagen"
brew "oven-sh/bun/bun"
brew "steipete/tap/remindctl"
brew "yakitrak/yakitrak/obsidian-cli"

# macOS casks
cask "1password"
cask "1password-cli"
cask "affinity"
cask "claude"
cask "claude-code"
cask "codex"
cask "discord"
cask "docker-desktop"
cask "firefox"
cask "font-bakbak-one"
cask "font-bebas-neue"
cask "font-blex-mono-nerd-font"
cask "font-cascadia-code"
cask "font-cascadia-code-nf"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-lilex-nerd-font"
cask "font-maple-mono"
cask "font-maple-mono-nf-cn"
cask "font-monaspace"
cask "font-montserrat"
cask "font-readex-pro"
cask "font-source-code-pro"
cask "font-victor-mono-nerd-font"
cask "font-zed-mono"
cask "font-zed-mono-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "github"
cask "google-chrome"
cask "hammerspoon"
cask "hyperkey"
cask "microsoft-teams"
cask "mochi"
cask "monitorcontrol"
cask "motrix"
cask "numi"
cask "obsidian"
cask "ogdesign-eagle"
cask "pearcleaner"
cask "rectangle"
cask "sf-symbols"
cask "todoist-app"
cask "visual-studio-code"
cask "whatsapp"
cask "yaak"
cask "zed"

# Mac App Store
mas "Awake", id: 1672795144
mas "Bear", id: 1091189122
mas "Color Picker", id: 1545870783
mas "DaisyDisk", id: 411643860
mas "Developer", id: 640199958
mas "Eagle for Safari", id: 1526651672
mas "iA Writer", id: 775737590
mas "iMovie", id: 408981434
mas "Pixelmator Pro", id: 1289583905
mas "Reeder", id: 6475002485
mas "ShellFish", id: 1336634154
mas "Tailscale", id: 1475387142
mas "Things", id: 904280696
mas "UTC Time", id: 1538245904
mas "Xcode", id: 497799835

# VSCode extensions
vscode "darkriszty.markdown-table-prettify"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "ms-azuretools.vscode-containers"
vscode "ms-vscode-remote.remote-containers"

# Cargo
cargo "model2vec-rs"
cargo "sitemapper"

# Manual installs (no Homebrew formula)
# bcli (Bear CLI via CloudKit): curl -L https://github.com/mreider/better-bear-cli/releases/latest/download/bcli-macos-universal.tar.gz | tar xz -C ~/.local/bin
