# Linux taps
tap "databricks/tap"
tap "hashicorp/tap"
tap "meridian-online/tap"
tap "runpod/runpodctl"
tap "shebe-oss/tap"
tap "turbot/tap"

# Linux CLI tools
brew "aria2"
brew "awscli"
brew "bash-language-server"
brew "bat"
brew "carapace"
brew "chafa"
brew "chezmoi"
brew "cloudflare-cli4"
brew "docker"
brew "duckdb"
brew "fd"
brew "fzf"
brew "gdu"
brew "gh"
brew "gitui"
brew "glow"
brew "go"
brew "gonzo"
brew "neovim"
brew "hf", link: false
brew "jless"
brew "jq"
brew "lazygit"
brew "marksman"
brew "navi"
brew "openjdk@17", link: true
brew "pre-commit"
brew "prettier"
brew "pyright"
brew "resvg"
brew "ripgrep"
brew "rtk"
brew "rust"
brew "sql-formatter"
brew "starship"
brew "taplo"
brew "tmux"
brew "tree"
brew "ty"
brew "typescript-language-server"
brew "ugrep"
brew "uv"
brew "visidata"
brew "wget"
brew "yaml-language-server"
brew "yazi"
brew "youplot"
brew "yq"
brew "zoxide"
brew "zsh-autocomplete"
brew "databricks/tap/databricks"
brew "hashicorp/tap/terraform"
brew "meridian-online/tap/finetype"
brew "runpod/runpodctl/runpodctl"
brew "shebe-oss/tap/shebe"
brew "turbot/tap/steampipe"

# Linux casks
cask "gcloud-cli"
