# Linux CLI tools
brew "bash-language-server"
brew "bat"
brew "carapace"
brew "chafa"
brew "docker"
brew "fd"
brew "fzf"
brew "gh"
brew "glow"
brew "helix"
brew "huggingface-cli"
brew "jq"
brew "lazygit"
brew "marksman"
brew "navi"
brew "prettier"
brew "resvg"
brew "ripgrep"
brew "rust"
brew "sql-formatter"
brew "starship"
brew "taplo"
brew "tmux"
brew "tree"
brew "ty"
brew "typescript-language-server"
brew "uv"
brew "visidata"
brew "wget"
brew "yaml-language-server"
brew "yazi"
brew "zoxide"
